<template>
    <h1 class="text-center font-bold text-2xl mb-4 mt-2">Інструкція до програми для складського обліку</h1>
    <div class="flex flex-col gap-2 text-justify px-20 text-lg indent-8">
        <p>Програма містить загальну таблицю товарів, яка зберігає всі товари, що можуть бути використані у операціях.
            Пошук
            товарів працює за кодом товару, назвою та категорією. При створенні товару можна вказати кількість або
            залишити
            її рівною нулю, а також вказати ціну або залишити її 0. Якщо товар видаляється, він повністю видаляється з
            бази
            даних.</p>

        <p>У розділі операцій можна створювати операції типу «Прихід» або «Продаж». Коментар до операції можна залишити
            порожнім, якщо він відсутній. Ліміт на кількість позицій у чеку відсутній. Якщо один товар має різні ціни,
            можна додати кілька позицій для цього товару з різними цінами. Ціну також можна залишити 0. Товар
            обов’язково потрібно обрати зі списку. Якщо його немає, перевірте загальну таблицю товарів. Пошук товарів у
            формі операції працює за кодом, назвою та категорією, і показує лише десять найближчих співпадінь. Поряд із
            назвою товару відображається кількість товару на складі. Якщо потрібно, дату операції також можна змінити.
        </p>

        <p>Розділ історії операцій дозволяє переглядати всі створені операції. Пошук у історії працює за кодом товару,
            назвою та категорією, а також за датами операцій, які можна вказати у полях «з» та «до». Якщо потрібно
            вказати
            лише одну дату, можна заповнити обидва поля однаковим значенням. При видаленні операції (чеку) вона повністю
            видаляється з бази даних.</p>
    </div>
</template>